Revit 2027 API
EnergyDataSettings.UseCurrentViewOnly Property
 True if only elements visible in the currently active view are used for generation of Energy Model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool UseCurrentViewOnly { get; set; }
Public Property UseCurrentViewOnly As Boolean
	Get
	Set
public:
property bool UseCurrentViewOnly {
	bool get ();
	void set (bool value);
}
member UseCurrentViewOnly : bool with get, set
Property Value
Boolean
Remarks
 This setting is ignored if the currently active view is not a 3D view or AnalysisType is RoomsOrSpaces.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace